In [0]:
import numpy as np
import pandas as pd
from pandas import DataFrame

In [0]:
dframe = DataFrame({'k1':['X','X','Y','Y','Z'], 'k2':['alpha','beta','alpha','beta','alpha'],
                     'dataset1':np.random.randn(5), 'dataset2':np.random.randn(5)})

In [5]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  0.557751  0.294148
1  X   beta -0.520063  0.444162
2  Y  alpha -1.645670  1.013434
3  Y   beta  1.052895 -0.799555
4  Z  alpha -0.680028  0.301516

In [0]:
group1 = dframe['dataset1'].groupby(dframe['k1']) # dataset1の値をk1でグループ化する

In [7]:
group1

In [8]:
group1.mean() # groupごとに平均値を求める

k1
X    0.018844
Y   -0.296388
Z   -0.680028
Name: dataset1, dtype: float64

In [0]:
cities = np.array(['NY', 'LA', 'LA', 'NY', 'NY'])
month = np.array([ 'JAN','FEB','JAN','FEB','JAN'])

In [10]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  0.557751  0.294148
1  X   beta -0.520063  0.444162
2  Y  alpha -1.645670  1.013434
3  Y   beta  1.052895 -0.799555
4  Z  alpha -0.680028  0.301516

In [11]:
dframe['dataset1'].groupby([cities, month]).mean() # citiesとmonthをキーにグループ化する

LA  FEB   -0.520063
    JAN   -1.645670
NY  FEB    1.052895
    JAN   -0.061138
Name: dataset1, dtype: float64

In [12]:
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X   0.018844  0.369155
Y  -0.296388  0.106940
Z  -0.680028  0.301516

In [13]:
dframe.groupby(['k1', 'k2']).mean() # 複数のキーでグループ化

          dataset1  dataset2
k1 k2
X  alpha  0.557751  0.294148
   beta  -0.520063  0.444162
Y  alpha -1.645670  1.013434
   beta   1.052895 -0.799555
Z  alpha -0.680028  0.301516

In [0]:
dataset2_group = dframe.groupby(['k1','k2'])[['dataset2']] # グループ化して出力する列を限定する

In [15]:
dataset2_group.mean()

          dataset2
k1 k2
X  alpha  0.294148
   beta   0.444162
Y  alpha  1.013434
   beta  -0.799555
Z  alpha  0.301516

In [16]:
dframe.groupby(['k1']).size() # それぞれのグループのデータ数

k1
X    2
Y    2
Z    1
dtype: int64

In [18]:
for name, group in dframe.groupby(['k1']):
  print('This is the {} group'.format(name))
  print(group)
  print('\n')

This is the X group
  k1     k2  dataset1  dataset2
0  X  alpha  0.557751  0.294148
1  X   beta -0.520063  0.444162


This is the Y group
  k1     k2  dataset1  dataset2
2  Y  alpha -1.645670  1.013434
3  Y   beta  1.052895 -0.799555


This is the Z group
  k1     k2  dataset1  dataset2
4  Z  alpha -0.680028  0.301516

In [19]:
for (k1, k2), group in dframe.groupby(['k1','k2']):
  print('key1={} key2={}'.format(k1,k2))
  print(group)
  print('\n')

key1=X key2=alpha
  k1     k2  dataset1  dataset2
0  X  alpha  0.557751  0.294148


key1=X key2=beta
  k1    k2  dataset1  dataset2
1  X  beta -0.520063  0.444162


key1=Y key2=alpha
  k1     k2  dataset1  dataset2
2  Y  alpha  -1.64567  1.013434


key1=Y key2=beta
  k1    k2  dataset1  dataset2
3  Y  beta  1.052895 -0.799555


key1=Z key2=alpha
  k1     k2  dataset1  dataset2
4  Z  alpha -0.680028  0.301516

In [0]:
gr = dframe.groupby('k1')

In [21]:
gr.get_group('X') # グループを指定して取得

  k1     k2  dataset1  dataset2
0  X  alpha  0.557751  0.294148
1  X   beta -0.520063  0.444162

In [0]:
group_dict = dict(list(dframe.groupby('k1'))) # dictとしてgroupを取得できる

In [28]:
group_dict['X']

  k1     k2  dataset1  dataset2
0  X  alpha  0.557751  0.294148
1  X   beta -0.520063  0.444162

In [0]:
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes, axis=1)))

In [30]:
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0  0.557751  0.294148
 1 -0.520063  0.444162
 2 -1.645670  1.013434
 3  1.052895 -0.799555
 4 -0.680028  0.301516, dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}